# Indexing & Selection & Filtering in Pandas

In [1]:
import pandas as pd
import numpy as np

C:\Users\Dipen\Anaconda3\lib\site-packages\pandas\compat\_optional.py:138: UserWarning: Pandas requires version '2.7.0' or newer of 'numexpr' (version '2.6.9' currently installed).
  warnings.warn(msg, UserWarning)

In [2]:
#Creating a pandas series
obj=pd.Series(np.arange(5),
              index=["a","b","c","d","e"])

In [4]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [6]:
obj["c"]  #Acecssing data at index "c"

2

In [7]:
obj[2]   #Acecssing data at index "2"

2

In [8]:
obj[0:3]   #Accessing data from index 0 to 2 (index 3 is exclusive)

a    0
b    1
c    2
dtype: int32

In [9]:
obj[["a","c"]]  #Accessing values at index 'a' and 'c'

a    0
c    2
dtype: int32

In [10]:
obj[[0,2]]    #Accessing values at index 0 and 2

a    0
c    2
dtype: int32

In [34]:
obj[obj>2]   # Gives only values greater than 2

d    3
e    4
dtype: int32

In [11]:
obj["a":"c"]   # Acessing values from index 'a' to 'c'

a    0
b    1
c    2
dtype: int32

In [36]:
obj["b":"c"]=5   # Assigns the value 5 to index 'b' and 'c'
obj

a    0
b    5
c    5
d    3
e    4
dtype: int32

## DataFrame Indexing

In [12]:
data=pd.DataFrame(
    np.arange(16).reshape(4,4),
    index=["London","Paris",
           "Berlin","Istanbul"],
    columns=["one","two","three","four"])
data

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [38]:
data["two"]   # All data from column "two"

London       1
Paris        5
Berlin       9
Istanbul    13
Name: two, dtype: int32

In [39]:
data[["one","two"]]    # All data from column "one" and "two"

          one  two
London      0    1
Paris       4    5
Berlin      8    9
Istanbul   12   13

In [40]:
data[:3]    # Gives row 0, 1 and 2

        one  two  three  four
London    0    1      2     3
Paris     4    5      6     7
Berlin    8    9     10    11

In [13]:
data[data["four"]>5]  # Only those rows having value greater than 5 in column 'four'

          one  two  three  four
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [42]:
data[data<5]=0   # Replace all values lesser than 5 by 0
data

          one  two  three  four
London      0    0      0     0
Paris       0    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

## Selecting with iloc and loc

In [43]:
data.iloc[1]  # All values from row 1

one      0
two      5
three    6
four     7
Name: Paris, dtype: int32

In [44]:
data.iloc[1,[1,2,3]]   # Values from row 1, columns 1, 2 and 3

two      5
three    6
four     7
Name: Paris, dtype: int32

In [14]:
data.iloc[[1,3],[1,2,3]] # Values from rows 1 and 3, columns 1, 2 and 3

          two  three  four
Paris       5      6     7
Istanbul   13     14    15

In [15]:
data.loc["Paris",["one","two"]] #values from index "Paris", columns "one" and "two"

one    4
two    5
Name: Paris, dtype: int32

In [47]:
data.loc[:"Paris","four"]  #Values from the first row to row with index "Paris" and column "four"

London    0
Paris     7
Name: four, dtype: int32

In [16]:
toy_data=pd.Series(np.arange(5),
                   index=["a","b","c",
                          "d","e"])
toy_data

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [18]:
toy_data[-1]   # Negative indexing in series, index of last value is -1

4